import baibaoxiang

Go= baibaoxiang.geturl
go= baibaoxiang.geturl("https://test-xiao.vdongtx.com/")
#**************************************************************************************通用模块*********************************************************
def Denglu():
    username="vdongshopplus"
    password="vdongchina2018"
    go.Sxpath("//input[@name='username']","用户名输入框",username,"成功输入用户名","输入用户名失败")
    go.Sxpath("//input[@name='password']","密码输入框",password,"成功输入密码","输入密码失败")
    try:
        go.Value("//input[@name='password']")
        cc=0
        if Go.value==password:
            go.Value("//input[@name='username']")
            cc=1
            if Go.value==username:
                print("账户密码输入正确，执行下一步")
                cc=2
    except:
        if cc==0:
            print("密码错误")
        elif cc==1:
            print("用户名错误")
    go.Cxpath("//*[@id='submit']","登陆按钮","登录中","无法点击登陆")

#**************************************************************************************通用模块*********************************************************


#**************************************************************************************进入私用模块*********************************************************


'''执行登录脚本'''
Denglu()


#**************************************************************************************这里开始是执行区域*********************************************************

#**************************************************************************************关闭浏览器*********************************************************
